-- =====================================
-- 必要なカラムだけ抽出 →　新テーブル作成
-- =====================================

-- 公共施設データ（公民館抽出）
-- -- public_facilities_cleaned
/*
SELECT  
      [NO]
      ,[名称]
      ,[名称_カナ]
      ,[住所]
      ,[緯度]
      ,[経度]
      ,[利用可能曜日]
      ,[所管課]
/*
       [都道府県コード又は市区町村コード]
      ,[地方公共団体名]
      ,[名称_通称]
      ,[POIコード]
      ,[方書]
      ,[電話番号]
      ,[内線番号]
      ,[法人番号]
      ,[団体名]
      ,[開始時間]
      ,[終了時間]
      ,[利用可能日時特記事項]
      ,[説明]
      ,[バリアフリー情報]
      ,[URL]
      ,[備考]
*/
  INTO public_facilities_cleaned
  FROM [public_faclility_analysis].[dbo].[public_facilities]
  WHERE [名称] LIKE '%公民館%'
*/



-- 市営住宅データ
-- -- municipal_housing_cleaned
/*
SELECT 
      [NO]
      ,[名称]
      ,[名称_カナ]
      ,[住所]
      ,[緯度]
      ,[経度]
/*
      [都道府県コード又は市区町村コード]
      ,[都道府県名]
      ,[市区町村名]
      ,[名称_通称]
      ,[POIコード]
      ,[方書]
      ,[内線番号]
      ,[法人番号]
      ,[団体名]
      ,[利用可能曜日]
      ,[開始時間]
      ,[終了時間]
      ,[利用可能日時特記事項]
      ,[説明]
      ,[バリアフリー情報]
      ,[URL]
      ,[備考]
      ,[電話番号]
*/
  INTO municipal_housing_cleaned
  FROM [public_faclility_analysis].[dbo].[municipal_housing]
  */


-- 人口データ
-- -- population_cleaned
/*
SELECT 
      [地域名]
      ,[総人口]
      ,[男性]
      ,[女性]
      ,[_0_4歳の男性]
      ,[_0_4歳の女性]
      ,[_5_9歳の男性]
      ,[_5_9歳の女性]
      ,[_10_14歳の男性]
      ,[_10_14歳の女性]
      ,[_15_19歳の男性]
      ,[_15_19歳の女性]
      ,[_20_24歳の男性]
      ,[_20_24歳の女性]
      ,[_25_29歳の男性]
      ,[_25_29歳の女性]
      ,[_30_34歳の男性]
      ,[_30_34歳の女性]
      ,[_35_39歳の男性]
      ,[_35_39歳の女性]
      ,[_40_44歳の男性]
      ,[_40_44歳の女性]
      ,[_45_49歳の男性]
      ,[_45_49歳の女性]
      ,[_50_54歳の男性]
      ,[_50_54歳の女性]
      ,[_55_59歳の男性]
      ,[_55_59歳の女性]
      ,[_60_64歳の男性]
      ,[_60_64歳の女性]
      ,[_65_69歳の男性]
      ,[_65_69歳の女性]
      ,[_70_74歳の男性]
      ,[_70_74歳の女性]
      ,[_75_79歳の男性]
      ,[_75_79歳の女性]
      ,[_80_84歳の男性]
      ,[_80_84歳の女性]
      ,[_85_89歳の男性]
      ,[_85_89歳の女性]
      ,[_90歳以上の男性]
      ,[_90歳以上の女性]
      ,[世帯数]
      ,[備考]
/*
      [都道府県名]
      ,[市区町村名]
      ,[都道府県コード又は市区町村コード]
      ,[調査年月日]
*/
  INTO dbo.population_cleaned
  FROM [public_faclility_analysis].[dbo].[population]
*/



-- 県内転出データ
-- -- intra_pref_migration_cleaned
/*
SELECT 
      [市区町村名]
      ,[転出先_転入元市区町村コード]
      ,[転出先_転入元市区町村名]
      ,[岩手県内市町村別転入者数_総数_人]
      ,[岩手県内市町村別転入者数_男_人]
      ,[岩手県内市町村別転入者数_女_人]
      ,[岩手県内市町村別転出者数_総数_人]
      ,[岩手県内市町村別転出者数_男_人]
      ,[岩手県内市町村別転出者数_女_人]
/*
      [都道府県名]
      ,[都道府県コード又は市区町村コード]
      ,[調査年月日]
*/
  INTO dbo.intra_pref_migration_cleaned
  FROM [public_faclility_analysis].[dbo].[intra_pref_migration]
*/



-- 県外転出入データ
-- -- inter_pref_migration_cleaned
/*
SELECT 
      [市区町村名]
      ,[転出先_転入元都道府県コード]
      ,[転出先_転入元都道府県名]
      ,[都道府県別転入者数_総数_人]
      ,[都道府県別転入者数_男性_人]
      ,[都道府県別転入者数_女性_人]
      ,[都道府県別転出者数_総数_人]
      ,[都道府県別転出者数_男性_人]
      ,[都道府県別転出者数_女性_人]
/*
      [都道府県名]
      , [都道府県コード又は市区町村コード]      
      ,[調査年月日]
*/
  INTO inter_pref_migration_cleaned
  FROM [public_faclility_analysis].[dbo].[inter_pref_migration]
*/


-- 年齢階級別転出入データ
-- -- migration_by_age_cleaned
/*
SELECT 
      [市区町村名]
      ,[年齢階級]
      ,[岩手県内転入者数_総数_人]
      ,[岩手県内転入者数_男_人]
      ,[岩手県内転入者数_女_人]
      ,[岩手県外転入者数_総数_人]
      ,[岩手県外転入者数_男_人]
      ,[岩手県外転入者数_女_人]
      ,[岩手県内転出者数_総数_人]
      ,[岩手県内転出者数_男_人]
      ,[岩手県内転出者数_女_人]
      ,[岩手県外転出者数_総数_人]
      ,[岩手県外転出者数_男_人]
      ,[岩手県外転出者数_女_人]
/*
　　　[都道府県名]
      ,[都道府県コード又は市区町村コード]
      ,[調査年月日]
*/
  INTO migration_by_age_cleaned
  FROM [public_faclility_analysis].[dbo].[migration_by_age]
*/